{
  "WW2HistoryEvents":
  [
    {
    "WW2EventTitle":"Great American Victory",
    "WW2EventSummary":"In 1945, at the end of the Second World War, the United States of America in fact emerged as the Great Superpower of the World. Once the United States of America became directly involved in the Second World War following the attack on Pearl Harbor, the American people in their righteous might won through to absolute victory (which is exactly what FDR said they would do). Many historians say that ultimately it was the work of the Manhattan Project led by the United States of America which really sealed the victory of the Allied Powers. Franklin D. Roosevelt, President of the United States of America, played a big role in the USA’s victory in WWII. It is also true that thanks to the leadership of Winston Churchill, Prime Minister of the United Kingdom, Great Britain survived.",
    "WW2EventTimeline":"1944 - 9/2/1945",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/The_USMC_War_Memorial.jpg",
    "WW2EventLink":"https://forrestww2history.wordpress.com"
    
    },
    
    {
    "WW2EventTitle":"1933 Takeover of Germany",
    "WW2EventSummary":"So, after WWI, Germany was suffering badly in the years leading up to 1933. Many German people were unemployed and thanks to the Treaty of Versailles, Germany had become disarmed, had to pay significant reparations and was even forced to give up territory. In 1933, Hitler and his militias take over Germany through the use of excessive demagoguery, exploitation of the bitterness among German WWI veterans, and blatant intimidation tactics. Legally speaking, Adolf Hitler was sworn into power on January 30th, 1933. After just a few months, Hitler’s totalitarian dictatorship is strongly installed in Germany. The days of Germany’s Weimar Republic are then officially a part of history. Adolf Hitler declares himself the “Fuhrer” (leader) of Germany, when actually he was installed as a dictator. Around 1933, Germany had a population of about eighty million Germans. And around 1933, France had around forty million French people. It is said that Adolf Hitler said that he was interested in having more 'living space' for his German people.",
    "WW2EventTimeline":"1932 - 1/30/1933",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/germany-gets-taken-over/"
    
    },
    
    {
    "WW2EventTitle":"Invasion of Poland",
    "WW2EventSummary":"Then, in the year 1939, everybody is astonished when the German-Soviet Pact is signed between that of the Soviet Union and Nazi Germany as a way to keep Russia from engaging in war with Nazi Germany as Hitler plans to try and eventually go take over France. Hitler is successful in invading Poland, starting by invading Danzig, Poland. Great Britain and France declare war on Nazi Germany. France pulls together those who will go to war to fight against the Nazis and head towards the German border, while many women and children will either stay put or flee. The French were said to have claimed that they did not have adequate weaponry or ammunition and that is why France would so easily become victim to Nazi Germany. The Maginot Line turns out to be no good after all (in terms of defense). The French did not extend the Maginot Line all the way along the Belgium border to the North Sea, which was a big mistake. The Maginot Line stopped at the Ardennes Forest because the French wrongly assumed that no big Nazi tanks would ever be able to get through it (too many trees they thought). Hitler would later take advantage of the fact that the French did not extend the Maginot Line all the way along the Ardennes Forest or have troops defending it. Adolf Hitler then bombs Warsaw, Poland. The Polish army surrenders to the German Nazis and also to the Soviets in the east near Russia.",
    "WW2EventTimeline":"9/1/1939 - 10/6/1939",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/poland-gets-invaded/"
    
    },
    
    {
    "WW2EventTitle":"Takeover of France",
    "WW2EventSummary":"So, in 1940, Hitler proceeds with his plan of sending a decoy army of Nazi soldiers maneuvering towards and into Belgium. The French general Gamelin falls right into the trap and sends his forces to Belgium thinking that the Nazis big attack will be through Belgium (just as the Germans did in 1914). French general (and commander in chief of the Allied Forces) Gamelin orders his entire British Expeditionary Forces and all of his best tanks and divisions. The Allied Forces mission at this point is to try to put a stop to the German Nazi invasion through Belgium. So, the Allied Forces proceed deep into Belgium territory, which was unfortunately exactly what Hitler wanted them to do (he was baiting them to go do that). Hitler then goes forward with his offensive sending the bulk of his Nazi army through the Ardennes Forest and then then the Allied Forces will be attacked from behind and encircled. As the bulk of the Nazi army is traveling through the Ardennes Forest, the diversionary tactics persist with Hitler sending in airborne Nazi forces dropping them into Belgium with their parachutes. The Nazi forces take over Fort Eben-Emael on Belgium border. The evacuations to Paris, France then ramp up when the fort so easily falls into the hands of the Nazis. The cities of Eastern and Northern France then are bombed repeatedly by the Nazis. The port of Rotterdam located within the Netherlands is bombed into total ruins, even after they surrendered. At this point, still in the year 1940, the Nazis are advancing through Sedan and trying further their pincer movement of encircling the French Allied Forces. The German Nazi army builds a bridge of the Meuse River. The Nazis send in their big tanks, then followed by infantry, which are then supported by Nazi aircrafts. Paris is now overrun with refugees. At this point it is May 17, 1940, and the French High Command now sees that the Allied Forces have fallen into Hitler’s pincer movement trap because the Nazis now moving towards the North Sea towards Belgium. So, then they send in a French tank brigade being led by Colonel de Gaulle in an attempt to save them, but despite the French tanks being of good quality, the French Tanks have no good aircraft support, infantry or reinforcements. The good quality French tank only get destroyed one by one by the Nazi aircrafts known as the “Stuka” aircrafts. The French aircrafts were way too outnumbered to support the French tanks and all the French aircrafts get shot down. The Nazis then advance through many Northern France towns without much resistance from the French. By now it is May 28, 1940, and the Nazis have reached the English Channel near Dunkirk. The Belgium Army, The French Forces and the British Expeditionary Force are totally surrounded near Dunkirk. The Belgium Army and the Belgium King then surrenders to the Nazis.",
    "WW2EventTimeline":"5/10/1940 - 6/25/1940",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/occupation-of-france/"
    
    },
    
    {
    "WW2EventTitle":"Invasion of Russia & Pearl Harbor",
    "WW2EventSummary":"On June 22, 1941, Operation Barbarossa is then set into motion by Hitler and the invasion of Russia begins. Four million invaders enter Russia, mostly Nazis and also many fascists invading alongside the Nazis. The Nazis and fascists have with them around four thousand good quality tanks and roughly three thousand Nazi aircrafts. Many Russian aircrafts are immediately destroyed and shot down when the invasion begins. As the Nazis travel through Russia, they realize just how vast the land mass is in Russia. As the Nazis and fascists make their way through Russia, Russian tanks put up a fight against the Nazi invaders, but the Nazis still neutralize many Russian tanks, and many Russians die as the Nazis advance. The Russians have very low supply of weapons such as rifles, which does not help the Russians in their fight against the Nazis. Stalin (political leader of the Soviet Union) gives the Russian people a major announcement letting them know that Russia is under attack by Nazis and fascists. Stalin tells the Russian farmers to burn everything that could possibly be of any use to the Nazis. The Russians hope to starve the Nazi invaders just like Napoleon Bonaparte’s powerful army was starved. As the Nazis continue their advance, many Russian survivors go hide in the forests as a way to escape being captured and then executed by the Nazis. Other Russians who are taken prisoner and not immediately executed are just starved to death as a result of being taken prisoner. Many Russian prisoners were starved to death by the Nazis. The Ukrainians are not accepted by the Nazis to be new allies. Instead, the Nazis totally squander an opportunity to add Ukrainians to their war efforts and just work them death and let them die. At this point in the war, the Nazis start rapidly increasing their executions of Jewish people. The Jewish people are made to dig their own graves before being executed by Nazis. The Nazis horrifically performed mass executions of women and children. The Russian soldiers are successful in taking many Nazis prisoner as well, and many Nazis are sent to Siberia. And then, on December 7, 1941, the Japanese attack the USA at Pearl Harbor naval base in the Pacific Ocean. Now, the Japanese have awakened a sleeping giant (The American people and their righteous might).",
    "WW2EventTimeline":"6/22/1941 & 12/7/1941",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/pearl-harbor/"
    
    },
    
    {
    "WW2EventTitle":"Battle for Russia",
    "WW2EventSummary":"The United States of America was attacked and is now directly involved in the war. It was a legitimately unprovoked attack on American lives and now Japan will have the war with the USA that they wanted. The American people will no longer be opposed to entering the horrible war going on after seeing Americans being murdered at Pearl Harbor. Around 2,500 Americans were murdered as a result of the Japanese attack at Pearl Harbor naval base, and around 1,200 Americans were injured. Only around 30 Japanese pilots were neutralized in their unprovoked/surprise attack on Pearl Harbor. The very next day on December 8th, 1941, Franklin D. Roosevelt (president of the USA) speaks before the United States congress and lets everybody know exactly what occurred on December 7, 1941. His tone is unforgettable, and his words are very appropriate. The Japanese then bomb the American air bases in the Philippines. Previously in 1937, the Japanese Army (Imperial Army) had engaged in horrific massacres of Chinese people. Around 300,000 Chinese were murdered in the Nanking massacre of 1937, for example. On December 10, 1941, two high quality British battleships are destroyed and sunk by Japanese aircrafts. Then, on December 11, 1941, Hitler thought it would be a bright idea to go ahead and declare war on the United States of America. Then, Hong Kong is taken over by the Japanese and many Allied forces are taken prisoner. The Allied prisoners are treated horribly, murdered, starved and worse. General Yamashita takes over Singapore. Many American soldiers were taken prisoner as well. American soldiers were murdered on infamous Bataan Death March. Winston Churchill and FDR agreed that Nazi Germany needed to be handled as the primary target and at that point in the war, Winston Churchill knew that Nazi Germany needed to be bombed.",
    "WW2EventTimeline":"6/22/1941 - 1/7/1942",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/hot-war-in-russia/"
    
    },
    
    {
    "WW2EventTitle":"Global Warfare Raging",
    "WW2EventSummary":"People keep dying all over the world as violent ware rages on and on. In October 1942, the Russians on the other side of the Volga River are still alive and fighting. The Russian soldiers are not allowed to retreat and any Russian soldiers who retreat are then killed by their Russian political commissars, even when the Russian soldiers are forced to try and fight without weapons. At this point in the war, the USA is now supplying massive amounts of good equipment to that of the Russians. Meanwhile, the Nazi known as Rommel is leading his Nazi troops through Africa and is nearing El Alamein, in Egypt. The Nazi known as Rommel, is thwarted and he retreats as a result of not being able to advance through to that of the Suez Canal. Meanwhile, in Stalingrad, the Nazis and fascists near the Volga River then find themselves surrounded by Russian forces, when the Russians do an encirclement maneuver to ensnare the Nazis in Stalingrad. FDR and Winston Churchill then essentially say that from now on, “unconditional surrender” is the only deal on the table for the Nazis, Italy and Japan. At that point, Stalin is pleased and then proceeds in having his Russian soldiers finish off the Nazis still lingering within Stalingrad.",
    "WW2EventTimeline":"1942 - 1943",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/world.png",
    "WW2EventLink":"https://forrestww2history.wordpress.com/global-warfare-raging/"
    
    },
    
    {
    "WW2EventTitle":"Allied Victory",
    "WW2EventSummary":"So, on the morning of June 6, 1944, the Allied forces in their watercrafts approach Normandy beaches. It is said that over 1,000 Allied troops died on Omaha beach, on D-Day. Many of the Allied troops were boys from Bedford, Virginia and other places of the USA. The Liberty Ships are set up on the waters near the Normandy beaches and the Allied forces unload their high-quality equipment and are ready to unleash their war machine on the Nazis and fascists. At this point in the war, the USA is a military superpower. The USA is now putting out one or more warships per day and has tremendous momentum building. The USA has over 11 million soldiers ready for anything. The USA armies are now in Asia, France, Italy and Northern Africa. At this point in the war, the power and innovation of the USA is strong that the USA is able to put together a second fleet just a big as the fleet which stormed the Normandy beaches and position the fleet in the Pacific Ocean. The Mariana Islands, which are at this point being occupied by the Japanese, will now be attacked by the USA and Allied Forces. When the United States Marines land on the small island of Taipan, it would then be one of the deadliest battles of the second world war. Around 30,000 Japanese soldiers will be killed or wounded in the Taipan battle. And around 20,0000 American soldiers will be killed or wounded in the Taipan battle. Meanwhile, Hitler has a new weapon that he will use on Great Britain, and it is that V-1 cruise missile. Hitler shoots the flying bombs over to London. These flying bombs fly for many miles and then run out of fuel by the time the flying bomb is in London and then drops down in London making a big explosion wherever it lands. At this point in the war, Hitler has dodged five attempts to assassinate him. Thousands and thousands of Nazi soldiers find themselves to be prisoners of war. The war unfolding very fast at this point in the war. Paris is liberated. Normandy is liberated. Belgium and France become entirely liberated from the Nazi reign of terror. General Douglas Macarthur said that he would in fact be back (to the Philippines), and then he in fact returned. The Philippines become liberated after a few months, at this point in the war. It is said that approximately six million Jewish people were killed in what would be known as the Holocaust. The United States is at this point in the war, still working on the atomic bomb, which would be used on Berlin and/or Japan. The United Nations will now be put together very soon. The American soldiers raise the great American flag in Iwo Jima, on February 23, 1945. Tokyo is then bombed on March 9, 1945. On April 30, 1945, Hitler murders his dog named blondie with a cyanide pill. Hitler marries Eva Braun, then Eva Braun dies by a cyanide pill. Hitler shoots his own self in the head. The Nazis are neutralized. Mussolini is killed by Italians. On August 6, 1945, the atomic bomb is dropped on Hiroshima, Japan. On August 9, 1945, a second atomic bomb is dropped, this time on Nagasaki, Japan. On September 2, 1945, the Japanese formally surrender.",
    "WW2EventTimeline":"1944 - 1945",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/winston.jpg",
        "WW2EventLink":"https://forrestww2history.wordpress.com/allied-victory/"
        
    },
    
    {
    "WW2EventTitle":"Feedback/Comments",
    "WW2EventSummary":"If you are interested in providing feedback on what you think about the app, please visit my website Feedback/Comments Page and submit feedback there. Feel free to add any other comments there as well. Please use the 'DETAILS' link below.",
    "WW2EventTimeline":"N/A",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/usa.jpg",
    "WW2EventLink":"https://forrestww2history.wordpress.com/feedback-comments-page/"
    
    },
    
    {
    "WW2EventTitle":"Work Cited",
    "WW2EventSummary":"If you are interested in viewing my work cited citations as it pertains to WW2 information, please visit my website Work Cited Page. Please use the 'DETAILS' link below.",
    "WW2EventTimeline":"N/A",
    "WW2EventImage":"https://raw.githubusercontent.com/user777999/JSONProjectsIT315/master/usa.jpg",
    "WW2EventLink":"https://forrestww2history.wordpress.com/work-cited-page/"
    
    }
  ],
  "Status":"OK"
}
